cmsis-svd/cmsis-svd/data/HDSC/HC32F146JX.svd
                <register>
                    <name>LCDRAM04</name>
                    <description>desc LCDRAM04</description>
                    <addressOffset>0x18</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM05</name>
                    <description>desc LCDRAM05</description>
                    <addressOffset>0x19</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM06</name>
                    <description>desc LCDRAM06</description>
                    <addressOffset>0x1A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM07</name>
                    <description>desc LCDRAM07</description>
                    <addressOffset>0x1B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM08</name>
                    <description>desc LCDRAM08</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM09</name>
                    <description>desc LCDRAM09</description>
                    <addressOffset>0x1D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM10</name>
                    <description>desc LCDRAM10</description>
                    <addressOffset>0x1E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM11</name>
                    <description>desc LCDRAM11</description>
                    <addressOffset>0x1F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM12</name>
                    <description>desc LCDRAM12</description>
                    <addressOffset>0x20</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM14</name>
                    <description>desc LCDRAM14</description>
                    <addressOffset>0x22</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM15</name>
                    <description>desc LCDRAM15</description>
                    <addressOffset>0x23</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM16</name>
                    <description>desc LCDRAM16</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM17</name>
                    <description>desc LCDRAM17</description>
                    <addressOffset>0x25</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM18</name>
                    <description>desc LCDRAM18</description>
                    <addressOffset>0x26</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM19</name>
                    <description>desc LCDRAM19</description>
                    <addressOffset>0x27</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM22</name>
                    <description>desc LCDRAM22</description>
                    <addressOffset>0x2A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM23</name>
                    <description>desc LCDRAM23</description>
                    <addressOffset>0x2B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM24</name>
                    <description>desc LCDRAM24</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM25</name>
                    <description>desc LCDRAM25</description>
                    <addressOffset>0x2D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM26</name>
                    <description>desc LCDRAM26</description>
                    <addressOffset>0x2E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM27</name>
                    <description>desc LCDRAM27</description>
                    <addressOffset>0x2F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM32</name>
                    <description>desc LCDRAM32</description>
                    <addressOffset>0x34</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM33</name>
                    <description>desc LCDRAM33</description>
                    <addressOffset>0x35</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM34</name>
                    <description>desc LCDRAM34</description>
                    <addressOffset>0x36</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM35</name>
                    <description>desc LCDRAM35</description>
                    <addressOffset>0x37</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM36</name>
                    <description>desc LCDRAM36</description>
                    <addressOffset>0x38</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM37</name>
                    <description>desc LCDRAM37</description>
                    <addressOffset>0x39</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM38</name>
                    <description>desc LCDRAM38</description>
                    <addressOffset>0x3A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>LCDRAM39</name>
                    <description>desc LCDRAM39</description>
                    <addressOffset>0x3B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
